{
  "education": [
    {
      "awards_achievements": [
        "Graduated with distinction",
        "Dean's List (2018-2020)",
        "GPA: 3.7"
      ],
      "degree": "Bachelor of Science (Honors)",
      "department": "Computer Science",
      "duration": "2017-2020",
      "school_name": "University of Windsor"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_HabibMohamed",
  "highlighted_projects": [
    {
      "description": "Automates the process of inserting data within a TSV/CSV file into a MYSQL database using Springboot. Allows for less time spent on inserting large files of data (gigabytes) as opposed to converting the CSV/TSV files into multiple SQL files and running them manually.",
      "git_url": "https://github.com/abdiclear/TSVtoMySQL",
      "name": "TSVtoMySQL"
    },
    {
      "description": "Leverages the concepts of routing and redux in React.js through a game that changes a department's mood based on the actions of another department, using TYpeScript/JavaScript and Visual Studio Code. Meant to be a light exercise in visualizing the idea behind the often unintuitive concepts of routing and redux.",
      "git_url": "https://github.com/abdiclear/department_wars",
      "name": "Department Wars"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Utilizes Linux Bash, Postgresql, and Docker to build a monitoring agent that collects data on Linux machine specifications and performance in a cluster.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Incorporates Spring Boot, Maven, Docker, JUnit, Mockito and leverages the Twitter API in order to deliver a command line interface to create, read, and delete tweets, set up integration and unit tests, and deploy to DockerHub.",
        "JDBC App: Sets up data manipulation of a retail database using Java, Maven, Docker and Postgresql.",
        "Grep App: Pipelines information on a target directory for files and lines via Java 8 Streams, along with Docker and Maven for deployment, and JUnit for testing, in order to find a given regular expression."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "Launches a trading system Proof of Concept for stock traders based on a three-layer microservice architecture in order to move away from the monolithic architecture the legacy trading system was based on. Developed the system using Springboot, JUnit, and Mockito for coding and testing, Docker and Maven for packaging and deployment, and REST API endpoints that allow for the system to handle HTTP requests/send out HTTP responses accordingly.",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "Analyzes retail data collected from a retailer's store and stored within an OLTP-database, which the retailer via ETL generates a sql file, in order to gain insight on customer behavior and tailor marketing campaigns for different customers. Stores the data from the sql file into an OLAP-database, Postgresql in this case, and is accessed from Jupyter Notebook. Using Pandas and MathPlotLib, statistics and plots are built to answer business queries. A RFM (Recency/Frequency/Monetary) segmentation table is developed with the data grouping customers together based on the frequency of their purchases, how recent their last purchase was, and how much they tend to spend.",
      "git_url": "/python_data_analytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "To be implemented.",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "To be implemented",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "To be implemented",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Habib Mohamed",
  "others": [
    {
      "bullets": [
        "Reading (favorite topics: history, innovation, technology)",
        "Playing sports (community soccer, basketball)",
        "Cryptocurrency investment (ADA, XLM)"
      ],
      "title": "Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Progressed through various projects and requirements using Java 8, Spring Boot, Linux, Git, Python, Docker, RDBMS, Hadoop, Spark/Scala, and Cloud/DevOps. Utilized communication methodology and tools such as Agile Scrum and Zoom. Conducted daily scrum sessions as team leader.",
      "duration": "2020-present",
      "title": "Data Engineer"
    },
    {
      "company": "Department of Computer Science, University of Windsor",
      "description": "Manipulated gigabytes of data in TSV/CSV format into being inserted in MySQL databases using PHP, JavaScript, and HTML/CSS/BootStrap. Communicated with clients on interface specifications and design, as well additional additions. Designed an interface for end users to retrieve data given an ID. Resulted in clients adopting the interfaces and successfully uploading/querying through gigabytes of data.",
      "duration": "2019-2020",
      "title": "Research Assistant"
    },
    {
      "company": "University of Windsor",
      "description": "Administrated classes over 100 students by grading, evaluating, and tutoring on concepts such as Linux and Internet fundamentals. Coordinated with professors and fellow teaching assistant on students' comprehension of material, as well as grading format.",
      "duration": "2017-2020",
      "title": "Teaching Assistant"
    },
    {
      "company": "University of Windsor",
      "description": "Orchestrated weekly lab sessions on game development in Unity and C#. Presided over student grading for major projects, as well as lab curriculum. Mentored students through the concepts of Software Development Life Cycle being applied to their game projects. Resulted in average student grade going up by a letter.",
      "duration": "2019",
      "title": "Lab Manager"
    },
    {
      "company": "Progressive Software International",
      "description": "Spearheaded the initiative to develop a responsive web client to replace the legacy web client. Utilized JavaScript/JQuery, HTML/CSS, BootStrap, Servoy and SQL to get the job done. Suggested to senior developers on improvements and adjustments that were feasible to implement. Presented the finished project at a company-wide meeting.",
      "duration": "2018",
      "title": "Youth Green Co-op Student"
    },
    {
      "company": "University of Windsor's Muslim Student Association",
      "description": "Directed the UWMSA's website in showcasing daily and upcoming events using Wordpress. Incorporated widgets to automate some daily tasks, seeing a boost in traffic as a result. Discussed with end-users on suggestions and feedback on website feel and functionality, and brought up implementable ideas to the board of directors.",
      "duration": "2017-2018",
      "title": "Web Manager"
    }
  ],
  "skills": {
    "competent": [
      "Maven",
      "Mockito",
      "JUnit",
      "Flutter",
      "PHP",
      "JavaScript",
      "TypeScript",
      "C/C++/C#"
    ],
    "familiar": [
      "Subversion",
      "Jenkins",
      "Node.js",
      "React.js",
      "Google Cloud Platform"
    ],
    "proficient": [
      "Java",
      "Springboot",
      "Python",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "Docker"
    ]
  },
  "summary": "I was introduced to computer science in a high school elective course on Java. I really enjoyed the problem-solving involved as well as the multitude of solutions one could come up with to a given problem. This solidified my decision to take computer science at the University of Windsor. During my time as an undergraduate, I gained various experiences including being a teaching assistant for courses on Linux and the Internet, successfully developing a mobile version of a web client as a co-op student, presiding over Unity/C# labs, and developing interfaces to upload gigabytes of medical data, as well query for data based on provided IDs as a research assistant. I graduated from the University of Windsor with distinction, obtaining a Honors Computer Science degree with software engineering specialization. I joined Jarvis as a data engineer, and am currently working on various projects utilizing software and tools such as Linux/Bash, RDBMS, Java 8, Python, Springboot, Hadoop, Spark/Scala, and Cloud/DevOps. I am looking to further my expertise as a developer in my next position, and hit the ground running in terms of contribution with the skills and experiences I have gained throughout my journey so far."
}
